Revit 2024 API
StructuralSectionUtils.GetStructuralElementDefinitionData Method
 Return structural element definition data.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static StructuralSectionErrorCode GetStructuralElementDefinitionData(
	Document document,
	ElementId elementId,
	out StructuralElementDefinitionData data
)
Visual Basic
Public Shared Function GetStructuralElementDefinitionData ( _
	document As Document, _
	elementId As ElementId, _
	<OutAttribute> ByRef data As StructuralElementDefinitionData _
) As StructuralSectionErrorCode
Visual C++
public:
static StructuralSectionErrorCode GetStructuralElementDefinitionData(
	Document^ document,
	ElementId^ elementId,
	[OutAttribute] StructuralElementDefinitionData^% data
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document that owns the beam, brace or structural column.
elementId
Type: Autodesk.Revit.DB.ElementId
 ID of family instance for beam, brace or structural column.
data
Type: Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData
 Structural element definition data.
Return Value
 Success code is returned if StructuralElementDefinitionData was provided successfully, error code otherwise.
Remarks
 This information is provided only for beams, braces and structural columns.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
StructuralSectionUtils Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace